spec/fixtures/responses/donation.json

{
  "donation": {
    "id": 1,
    "site_id": 6,
    "created_at": "2016-03-30T14:41:48+02:00",
    "updated_at": "2016-03-30T14:46:25+02:00",
    "first_name": "John",
    "last_name": "Doe",
    "anonymous": false,
    "email": "john.doe@kentaa.nl",
    "newsletter": false,
    "device_type": "desktop",
    "locale": "nl",
    "currency": "EUR",
    "amount": "15.0",
    "transaction_costs": "0.4",
    "start_donation": false,
    "registration_fee": true,
    "registration_fee_amount": "10.0",
    "total_amount": "25.4",
    "receivable_amount": "24.0",
    "invoicenumber": "T2016.0001.0000001",
    "payment_method": "ideal",
    "payment_status": "paid",
    "payment_status_at": "2016-03-30T14:46:25+02:00",
    "transaction_id": "B5C7B7BCAF1ADF6E2032C7CF56969876",
    "payment_id": "116D10DD544ECD1E2D77762C5C3E6D61",
    "payment_description": "Donatie demo",
    "target_url": "https://demo1.kentaa.nl/",
    "questions": [
      {
        "id": 1,
        "created_at": "2015-08-26T14:50:16.166+02:00",
        "updated_at": "2015-08-26T14:50:20.477+02:00",
        "question": "Gender",
        "answer": "male"
      }
    ],
    "reward": {
      "id": 1,
      "type": "SiteReward",
      "title": "Awesome reward",
      "description": "Lorem ipsum",
      "ask_for_address": true
    },
    "address": {
      "address": "Jansbuitensingel 6",
      "zipcode": "6811AA",
      "city": "Arnhem",
      "country": "NL"
    },
    "consent": {
      "url": "https://demo1.kentaa.nl/doneren",
      "text": "Ik accepteer de <a href='/algemene-voorwaarden' class='theme-text-color' target='_blank'>Algemene voorwaarden</a>.",
      "version": "V2 22-06-2018 13:09"
    }
  }
}
